// Задача 36: Задайте одномерный массив, заполненный случайными числами.
//  Найдите сумму элементов, стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19
// [-4, -6, 89, 6] -> 0

int[] newArray = GetArray(10, 1, 20);
System.Console.WriteLine();
System.Console.WriteLine($"[{String.Join(',', newArray)}]");
System.Console.WriteLine($"сумма элементов, стоящих на нечётных позициях = {OddNumberPosSum(newArray)}");

//function

int[] GetArray(int size, int min, int max)
{
    int[] arr = new int[size];
    for (int i = 0; i < size; i++)
    {
        arr[i] = new Random().Next(min, max + 1);
    }
    return arr;
}

int OddNumberPosSum(int[] arr)
{
    int sum = 0;
    for (int i = 1; i < arr.Length; i += 2)
    {
        sum = sum + arr[i];
    }
    return sum;
}
